ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/TOP_CTRL_TOP_CTRL_50D80000h.xml
<module name="TOP_CTRL" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="TOP_CTRL_EFUSE_DIEID0" acronym="TOP_CTRL_EFUSE_DIEID0" offset="16" width="32" description="EFUSE_DIEID0.">
		<bitfield id="EFUSE_DIEID0_VAL" width="32" begin="31" end="0" resetval="0x0" description="EFUSE DieID[31:0]" range="31:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_EFUSE_DIEID1" acronym="TOP_CTRL_EFUSE_DIEID1" offset="20" width="32" description="EFUSE_DIEID1.">
		<bitfield id="EFUSE_DIEID1_VAL" width="32" begin="31" end="0" resetval="0x0" description="EFUSE DieID[63:32]" range="31:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_EFUSE_DIEID2" acronym="TOP_CTRL_EFUSE_DIEID2" offset="24" width="32" description="EFUSE_DIEID2.">
		<bitfield id="EFUSE_DIEID2_VAL" width="32" begin="31" end="0" resetval="0x0" description="EFUSE DieID[95:64]" range="31:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_EFUSE_DIEID3" acronym="TOP_CTRL_EFUSE_DIEID3" offset="28" width="32" description="EFUSE_DIEID3.">
		<bitfield id="EFUSE_DIEID3_VAL" width="32" begin="31" end="0" resetval="0x0" description="EFUSE DieID[127:96]" range="31:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_EFUSE_UID0" acronym="TOP_CTRL_EFUSE_UID0" offset="32" width="32" description="EFUSE_UID0.">
		<bitfield id="EFUSE_UID0_VAL" width="32" begin="31" end="0" resetval="0x0" description="EFUSE UID[31:0]- Unique ID" range="31:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_EFUSE_UID1" acronym="TOP_CTRL_EFUSE_UID1" offset="36" width="32" description="EFUSE_UID1.">
		<bitfield id="EFUSE_UID1_VAL" width="32" begin="31" end="0" resetval="0x0" description="EFUSE UID[63:32]- Unique ID" range="31:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_EFUSE_UID2" acronym="TOP_CTRL_EFUSE_UID2" offset="40" width="32" description="EFUSE_UID2.">
		<bitfield id="EFUSE_UID2_VAL" width="32" begin="31" end="0" resetval="0x0" description="EFUSE UID[95:64]- Unique ID" range="31:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_EFUSE_UID3" acronym="TOP_CTRL_EFUSE_UID3" offset="44" width="32" description="EFUSE_UID3.">
		<bitfield id="EFUSE_UID3_VAL" width="24" begin="23" end="0" resetval="0x0" description="EFUSE UID[120:96]- Unique ID" range="23:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_EFUSE_DEVICE_TYPE" acronym="TOP_CTRL_EFUSE_DEVICE_TYPE" offset="48" width="32" description="EFUSE_DEVICE_TYPE.">
		<bitfield id="EFUSE_DEVICE_TYPE_VAL" width="16" begin="15" end="0" resetval="0x0" description="EFUSE Device Type : 0x5 - Test Device 0x3 - General Purpose Device 0x9 - EMU Device 0xA - High Secure" range="15:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_EFUSE_FROM0_CHECKSUM" acronym="TOP_CTRL_EFUSE_FROM0_CHECKSUM" offset="52" width="32" description="EFUSE_FROM0_CHECKSUM.">
		<bitfield id="EFUSE_FROM0_CHECKSUM_VAL" width="32" begin="31" end="0" resetval="0x0" description="32 bit FROM0 Checksum" range="31:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_EFUSE_JTAG_USERCODE_ID" acronym="TOP_CTRL_EFUSE_JTAG_USERCODE_ID" offset="56" width="32" description="EFUSE_JTAG_USERCODE_ID.">
		<bitfield id="EFUSE_JTAG_USERCODE_ID_VAL" width="32" begin="31" end="0" resetval="0x0" description="EFUSE JTAG_USER_CODE_ID[31:0]. Denotes part variant" range="31:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_EFUSE1_ROW_12" acronym="TOP_CTRL_EFUSE1_ROW_12" offset="1064" width="32" description="EFUSE Row.">
		<bitfield id="EFUSE1_ROW_12_EPWM_FEATURE_DISABLE" width="1" begin="24" end="24" resetval="0x0" description="Customer protected features inside PWM IP 1'b0 -  All features enabled1'b1 - Customer defined features are protected" range="24" rwaccess="R"/>
	<bitfield id="EFUSE1_ROW_12_CANFD_DIS" width="4" begin="23" end="20" resetval="0x0" description="CANFD disables. Bit positions correspond to CAN instance. 1'b0 - CAN is enabled1'b1 - CAN is disabled" range="23:20" rwaccess="R"/>
	<bitfield id="EFUSE1_ROW_12_PRU_ICSS_HW_DIS" width="8" begin="19" end="12" resetval="0x0" description="ICSSM IP feature configuration0x00:EtherCAT is available0x03:EtherCAT is disabled" range="19:12" rwaccess="R"/>
	<bitfield id="EFUSE1_ROW_12_PRU_ICSS_DIS" width="1" begin="11" end="11" resetval="0x0" description="ICSSM IP disable1'b0 -  ICSSM enabled1'b1 - ICSSM disabled" range="11" rwaccess="R"/>
	<bitfield id="EFUSE1_ROW_12_TWOX_CTRL_PERIP_DISABLE" width="1" begin="10" end="10" resetval="0x0" description="2x control IPs enabled1'b0 -  1x control IPs available (Standard Analog Configuration)1'b1 - (i.e.all) 2x control IPs available (Enhanced Analog Configuration) Refer to device datasheet for more details on the control IP Counts" range="10" rwaccess="R"/>
	<bitfield id="EFUSE1_ROW_12_R5SS_FREQ" width="1" begin="9" end="9" resetval="0x0" description="R5SS Freq1'b0 -  400 MHz1'b1 - 200 MHz" range="9" rwaccess="R"/>
	<bitfield id="EFUSE1_ROW_12_R5SS1_DISABLE" width="1" begin="8" end="8" resetval="0x0" description="R5SS1 Disabled" range="8" rwaccess="R"/>
	<bitfield id="EFUSE1_ROW_12_R5SS1_DUAL_CORE_DISABLE" width="1" begin="7" end="7" resetval="0x0" description="Force Lock step" range="7" rwaccess="R"/>
	<bitfield id="EFUSE1_ROW_12_R5SS1_FORCE_DUAL_CORE" width="1" begin="6" end="6" resetval="0x0" description="Force Dual core" range="6" rwaccess="R"/>
	<bitfield id="EFUSE1_ROW_12_R5SS0_DUAL_CORE_DISABLE" width="1" begin="5" end="5" resetval="0x0" description="Force Lock step" range="5" rwaccess="R"/>
	<bitfield id="EFUSE1_ROW_12_R5SS0_FORCE_DUAL_CORE" width="1" begin="4" end="4" resetval="0x0" description="Force Dual core" range="4" rwaccess="R"/>
	<bitfield id="EFUSE1_ROW_12_L2_MEM_SIZE" width="4" begin="3" end="0" resetval="0x0" description="Decides memory size0000L2-3.0 MB0001L2-2.5 MB0010L2-2.0 MB0011L2-1.5 MB0100L2-1.0 MB0101L2-0.5 MBOthers-Reserved" range="3:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_MAC_ID0" acronym="TOP_CTRL_MAC_ID0" offset="1280" width="32" description="Ethernet MAC address lower 32-bits.">
		<bitfield id="MAC_ID0_MACID_LO" width="32" begin="31" end="0" resetval="0x0" description="48-bit Ethernet MAC_ID field [can be used by SW through MMR read]  - MAC ID low [32bits]" range="31:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_MAC_ID1" acronym="TOP_CTRL_MAC_ID1" offset="1284" width="32" description="Ethernet MAC address upper 16-bits.">
		<bitfield id="MAC_ID1_MACID_HI" width="16" begin="15" end="0" resetval="0x0" description="48-bit Ethernet MAC_ID field [can be used by SW through MMR read]  - MAC ID high [16bits]" range="15:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_EFUSE_OVERRIDE_LDO_TRIM" acronym="TOP_CTRL_EFUSE_OVERRIDE_LDO_TRIM" offset="2176" width="32" description=" ">
		<bitfield id="EFUSE_OVERRIDE_LDO_TRIM_LDO_TRIM_OFFSET" width="6" begin="29" end="24" resetval="0x0" description="LDO Fine trim around program point" range="29:24" rwaccess="R/W"/>
	<bitfield id="EFUSE_OVERRIDE_LDO_TRIM_LDO_PROG" width="4" begin="19" end="16" resetval="0x0" description="LDO programming controls. Adjusts nominal LDO output voltage" range="19:16" rwaccess="R/W"/>
	<bitfield id="EFUSE_OVERRIDE_LDO_TRIM_OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_ADC_REFBUF0_CTRL" acronym="TOP_CTRL_ADC_REFBUF0_CTRL" offset="3072" width="32" description="This register is used to enable or disable ADC Reference buffer 0">
		<bitfield id="ADC_REFBUF0_CTRL_ENABLE" width="3" begin="2" end="0" resetval="0x0" description="Enables adc reference 0, mask hhv before enable000:Disable111 : Enable" range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_ADC_REFBUF1_CTRL" acronym="TOP_CTRL_ADC_REFBUF1_CTRL" offset="3076" width="32" description="This register is used to enable or disable ADC Reference buffer 1">
		<bitfield id="ADC_REFBUF1_CTRL_ENABLE" width="3" begin="2" end="0" resetval="0x0" description="Enables adc reference 0, mask hhv before enable000:Disable111 : Enable" range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_ADC_REF_COMP_CTRL" acronym="TOP_CTRL_ADC_REF_COMP_CTRL" offset="3080" width="32" description="This register is used to enable or disable the voltage monitors  which measure if the ADC reference voltage is good or not.">
		<bitfield id="ADC_REF_COMP_CTRL_ADCR01_REFOK_EN" width="3" begin="14" end="12" resetval="0x0" description="Enables reference comparators [ROK2]. This monitors adc5 &#38; adc6 refernce" range="14:12" rwaccess="R/W"/>
	<bitfield id="ADC_REF_COMP_CTRL_ADC34_REFOK_EN" width="3" begin="10" end="8" resetval="0x0" description="Enables reference comparators [ROK1]. This monitors adc3 &#38; adc4 refernc" range="10:8" rwaccess="R/W"/>
	<bitfield id="ADC_REF_COMP_CTRL_ADC12_REFOK_EN" width="3" begin="6" end="4" resetval="0x0" description="Enables reference comparators [ROK0B]. This monitors adc1 &#38; adc2 refernce" range="6:4" rwaccess="R/W"/>
	<bitfield id="ADC_REF_COMP_CTRL_ADC0_REFOK_EN" width="3" begin="2" end="0" resetval="0x0" description="Enables reference comparators [ROK0]. This monitors adc0 refernce" range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_ADC_REF_GOOD_STATUS" acronym="TOP_CTRL_ADC_REF_GOOD_STATUS" offset="3084" width="32" description="This register shows the status of ADC reference voltages as measured by the ADC Reference OK voltage monitors.">
		<bitfield id="ADC_REF_GOOD_STATUS_ADCR01_REF_UV_GOOD" width="1" begin="7" end="7" resetval="0x1" description="Under Voltage check OK1'b1 - Comparator output is ok for under voltage condition.1'b0 - Comparator output is 1'b0 as threshold condition is not meeting for under voltage condition" range="7" rwaccess="R"/>
	<bitfield id="ADC_REF_GOOD_STATUS_ADCR01_REF_OV_GOOD" width="1" begin="6" end="6" resetval="0x1" description="Over voltage check OK1'b1 - Comparator output is ok for over voltage condition.1'b0 - Comparator output is 1'b0 as threshold condition is not meeting for over voltage condition" range="6" rwaccess="R"/>
	<bitfield id="ADC_REF_GOOD_STATUS_ADC12_REF_UV_GOOD" width="1" begin="5" end="5" resetval="0x1" description="Under Voltage check OK1'b1 - Comparator output is ok for under voltage condition.1'b0 - Comparator output is 1'b0 as threshold condition is not meeting for under voltage condition" range="5" rwaccess="R"/>
	<bitfield id="ADC_REF_GOOD_STATUS_ADC12_REF_OV_GOOD" width="1" begin="4" end="4" resetval="0x1" description="Over voltage check OK1'b1 - Comparator output is ok for over voltage condition.1'b0 - Comparator output is 1'b0 as threshold condition is not meeting for over voltage condition" range="4" rwaccess="R"/>
	<bitfield id="ADC_REF_GOOD_STATUS_ADC0_REF_UV_GOOD" width="1" begin="3" end="3" resetval="0x1" description="Under Voltage check OK1'b1 - Comparator output is ok for under voltage condition.1'b0 - Comparator output is 1'b0 as threshold condition is not meeting for under voltage condition" range="3" rwaccess="R"/>
	<bitfield id="ADC_REF_GOOD_STATUS_ADC0_REF_OV_GOOD" width="1" begin="2" end="2" resetval="0x1" description="Over voltage check OK1'b1 - Comparator output is ok for over voltage condition.1'b0 - Comparator output is 1'b0 as threshold condition is not meeting for over voltage condition" range="2" rwaccess="R"/>
	<bitfield id="ADC_REF_GOOD_STATUS_ADC34_REF_UV_GOOD" width="1" begin="1" end="1" resetval="0x1" description="Under Voltage check OK1'b1 - Comparator output is ok for under voltage condition.1'b0 - Comparator output is 1'b0 as threshold condition is not meeting for under voltage condition" range="1" rwaccess="R"/>
	<bitfield id="ADC_REF_GOOD_STATUS_ADC34_REF_OV_GOOD" width="1" begin="0" end="0" resetval="0x1" description="Over voltage check OK1'b1 - Comparator output is ok for over voltage condition.1'b0 - Comparator output is 1'b0 as threshold condition is not meeting for over voltage condition" range="0" rwaccess="R"/>
	</register><register id="TOP_CTRL_VMON_CTRL" acronym="TOP_CTRL_VMON_CTRL" offset="3088" width="32" description="This register is used to enable or disable the power supply voltage monitors present on the device.">
		<bitfield id="VMON_CTRL_CMP8_EN" width="3" begin="26" end="24" resetval="0x7" description="Enable for VMON comparator 8 Configure it to 3'000 to disable it." range="26:24" rwaccess="R/W"/>
	<bitfield id="VMON_CTRL_CMP7_EN" width="3" begin="22" end="20" resetval="0x7" description="Enable for VMON comparator 7 Configure it to 3'000 to disable it." range="22:20" rwaccess="R/W"/>
	<bitfield id="VMON_CTRL_CMP5_EN" width="3" begin="18" end="16" resetval="0x7" description="Enable for VMON comparator 5 Configure it to 3'000 to disable it." range="18:16" rwaccess="R/W"/>
	<bitfield id="VMON_CTRL_CMP3_EN" width="3" begin="14" end="12" resetval="0x7" description="Enable for VMON comparator 3 Configure it to 3'000 to disable it." range="14:12" rwaccess="R/W"/>
	<bitfield id="VMON_CTRL_CMP2_EN" width="3" begin="10" end="8" resetval="0x7" description="Enable for VMON comparator 2 Configure it to 3'000 to disable it." range="10:8" rwaccess="R/W"/>
	<bitfield id="VMON_CTRL_CMP1_EN" width="3" begin="6" end="4" resetval="0x7" description="Enable for VMON comparator 1 Configure it to 3'000 to disable it." range="6:4" rwaccess="R/W"/>
	<bitfield id="VMON_CTRL_CMP0_EN" width="3" begin="2" end="0" resetval="0x7" description="Enable for VMON comparator 0 Configure it to 3'000 to disable it." range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_VMON_STAT" acronym="TOP_CTRL_VMON_STAT" offset="3092" width="32" description="This register shows the status output from the voltage monitors present on the device.">
		<bitfield id="VMON_STAT_CMP8_UV_OK" width="1" begin="10" end="10" resetval="0x1" description="VMON status register for comparator 8. 1'b1 - Comparator output is ok for under voltage condition.1'b0 - Comparator output is 1'b0 as threshold condition is not meeting for under voltage condition" range="10" rwaccess="R"/>
	<bitfield id="VMON_STAT_CMP7_UV_OK" width="1" begin="9" end="9" resetval="0x1" description="VMON status register for comparator 7.1'b1 - Comparator output is ok for under voltage condition.1'b0 - Comparator output is 1'b0 as threshold condition is not meeting for under voltage condition" range="9" rwaccess="R"/>
	<bitfield id="VMON_STAT_CMP5_UV_OK" width="1" begin="8" end="8" resetval="0x1" description="VMON status register for comparator 5. 1'b1 - Comparator output is ok for under voltage condition.1'b0 - Comparator output is 1'b0 as threshold condition is not meeting for under voltage condition" range="8" rwaccess="R"/>
	<bitfield id="VMON_STAT_CMP5_OV_OK" width="1" begin="7" end="7" resetval="0x1" description="VMON status register for comparator 5." range="7" rwaccess="R"/>
	<bitfield id="VMON_STAT_CMP3_UV_OK" width="1" begin="6" end="6" resetval="0x1" description="VMON status register for comparator 3.1'b1 - Comparator output is ok for under voltage condition.1'b0 - Comparator output is 1'b0 as threshold condition is not meeting for under voltage condition" range="6" rwaccess="R"/>
	<bitfield id="VMON_STAT_CMP3_OV_OK" width="1" begin="5" end="5" resetval="0x1" description="VMON status register for comparator 3.1'b1 - Comparator output is ok for over voltage condition.1'b0 - Comparator output is 1'b0 as threshold condition is not meeting for over voltage condition" range="5" rwaccess="R"/>
	<bitfield id="VMON_STAT_CMP2_UV_OK" width="1" begin="4" end="4" resetval="0x1" description="VMON status register for comparator 2. 1'b1 - Comparator output is ok for under voltage condition.1'b0 - Comparator output is 1'b0 as threshold condition is not meeting for under voltage condition" range="4" rwaccess="R"/>
	<bitfield id="VMON_STAT_CMP2_OV_OK" width="1" begin="3" end="3" resetval="0x1" description="VMON status register for comparator 2. 1'b1 - Comparator output is ok for over voltage condition.1'b0 - Comparator output is 1'b0 as threshold condition is not meeting for over voltage condition" range="3" rwaccess="R"/>
	<bitfield id="VMON_STAT_CMP1_UV_OK" width="1" begin="2" end="2" resetval="0x1" description="VMON status register for comparator 1. 1'b1 - Comparator output is ok for under voltage condition.1'b0 - Comparator output is 1'b0 as threshold condition is not meeting for under voltage condition" range="2" rwaccess="R"/>
	<bitfield id="VMON_STAT_CMP1_OV_OK" width="1" begin="1" end="1" resetval="0x1" description="VMON status register for comparator 1. 1'b1 - Comparator output is ok for over voltage condition.1'b0 - Comparator output is 1'b0 as threshold condition is not meeting for over voltage condition" range="1" rwaccess="R"/>
	<bitfield id="VMON_STAT_CMP0_UV_OK" width="1" begin="0" end="0" resetval="0x1" description="VMON status register for comparator 0. 1'b1 - Comparator output is ok for under voltage condition.1'b0 - Comparator output is 1'b0 as threshold condition is not meeting for under voltage condition" range="0" rwaccess="R"/>
	</register><register id="TOP_CTRL_PMU_COARSE_STAT" acronym="TOP_CTRL_PMU_COARSE_STAT" offset="3096" width="32" description="This register shows the status of coarse voltage monitors present in the device.">
		<bitfield id="PMU_COARSE_STAT_BG_RDY" width="1" begin="3" end="3" resetval="0x1" description="Bandgap coarse detection status signals." range="3" rwaccess="R"/>
	<bitfield id="PMU_COARSE_STAT_LDO_RDY" width="1" begin="2" end="2" resetval="0x1" description="LDO coarse detection status signals." range="2" rwaccess="R"/>
	<bitfield id="PMU_COARSE_STAT_VCORE_RDY" width="1" begin="1" end="1" resetval="0x1" description="vcore coarse detection status signals." range="1" rwaccess="R"/>
	<bitfield id="PMU_COARSE_STAT_VSUP18_RDY" width="1" begin="0" end="0" resetval="0x1" description="vdda18 coarse detection status signals." range="0" rwaccess="R"/>
	</register><register id="TOP_CTRL_MASK_VMON_ERROR_ESM_H" acronym="TOP_CTRL_MASK_VMON_ERROR_ESM_H" offset="3104" width="32" description="This register is used to select the voltage monitors whose Error staus should   triggering the ESM High Interrupt.">
		<bitfield id="MASK_VMON_ERROR_ESM_H_ADCR01_REF_UV_MASK" width="1" begin="18" end="18" resetval="0x1" description="ADCR01 REF UV VMON Error Mask to ESM Interrupt" range="18" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_H_ADCR01_REF_OV_MASK" width="1" begin="17" end="17" resetval="0x1" description="ADCR01 REF OV VMON Error Mask to ESM Interrupt" range="17" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_H_ADC12_REF_UV_MASK" width="1" begin="16" end="16" resetval="0x1" description="ADC34 REF UV VMON Error Mask to ESM Interrupt" range="16" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_H_ADC12_REF_OV_MASK" width="1" begin="15" end="15" resetval="0x1" description="ADC34 REF OV VMON Error Mask to ESM Interrupt" range="15" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_H_ADC0_REF_UV_MASK" width="1" begin="14" end="14" resetval="0x1" description="ADC12 REF UV VMON Error Mask to ESM Interrupt" range="14" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_H_ADC0_REF_OV_MASK" width="1" begin="13" end="13" resetval="0x1" description="ADC12 REF OV VMON Error Mask to ESM Interrupt" range="13" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_H_ADC34_REF_UV_MASK" width="1" begin="12" end="12" resetval="0x1" description="ADC0 REF UV VMON Error Mask to ESM Interrupt" range="12" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_H_ADC34_REF_OV_MASK" width="1" begin="11" end="11" resetval="0x1" description="ADC0 REF OV VMON Error Mask to ESM Interrupt" range="11" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_H_CMP8_UV_ERR_MASK" width="1" begin="10" end="10" resetval="0x1" description="CMP8 UV VMON Error Mask to ESM Interrupt" range="10" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_H_CMP7_UV_ERR_MASK" width="1" begin="9" end="9" resetval="0x1" description="CMP7 UV VMON Error Mask to ESM Interrupt" range="9" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_H_CMP5_UV_ERR_MASK" width="1" begin="8" end="8" resetval="0x1" description="CMP5 UV VMON Error Mask to ESM Interrupt" range="8" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_H_CMP5_OV_ERR_MASK" width="1" begin="7" end="7" resetval="0x1" description="CMP5 OV VMON Error Mask to ESM Interrupt" range="7" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_H_CMP3_UV_ERR_MASK" width="1" begin="6" end="6" resetval="0x1" description="CMP3 UV VMON Error Mask to ESM Interrupt" range="6" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_H_CMP3_OV_ERR_MASK" width="1" begin="5" end="5" resetval="0x1" description="CMP3 OV VMON Error Mask to ESM Interrupt" range="5" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_H_CMP2_UV_ERR_MASK" width="1" begin="4" end="4" resetval="0x1" description="CMP2 UV VMON Error Mask to ESM Interrupt" range="4" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_H_CMP2_OV_ERR_MASK" width="1" begin="3" end="3" resetval="0x1" description="CMP2 OV VMON Error Mask to ESM Interrupt" range="3" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_H_CMP1_UV_ERR_NASK" width="1" begin="2" end="2" resetval="0x1" description="CMP1 UV VMON Error Mask to ESM Interrupt" range="2" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_H_CMP1_OV_ERR_MASK" width="1" begin="1" end="1" resetval="0x1" description="CMP1 OV VMON Error Mask to ESM Interrupt" range="1" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_H_CMP0_UV_ERR_MASK" width="1" begin="0" end="0" resetval="0x1" description="CMP0 UV VMON Error Mask to ESM Interrupt" range="0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_MASK_VMON_ERROR_ESM_L" acronym="TOP_CTRL_MASK_VMON_ERROR_ESM_L" offset="3108" width="32" description="This register is used to select the voltage monitors whose Error staus should   triggering the ESM Low Interrupt.">
		<bitfield id="MASK_VMON_ERROR_ESM_L_ADCR01_REF_UV_MASK" width="1" begin="18" end="18" resetval="0x1" description="ADCR01 REF UV VMON Error Mask to ESM Interrupt" range="18" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_L_ADCR01_REF_OV_MASK" width="1" begin="17" end="17" resetval="0x1" description="ADCR01 REF OV VMON Error Mask to ESM Interrupt" range="17" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_L_ADC12_REF_UV_MASK" width="1" begin="16" end="16" resetval="0x1" description="ADC34 REF UV VMON Error Mask to ESM Interrupt" range="16" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_L_ADC12_REF_OV_MASK" width="1" begin="15" end="15" resetval="0x1" description="ADC34 REF OV VMON Error Mask to ESM Interrupt" range="15" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_L_ADC0_REF_UV_MASK" width="1" begin="14" end="14" resetval="0x1" description="ADC12 REF UV VMON Error Mask to ESM Interrupt" range="14" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_L_ADC0_REF_OV_MASK" width="1" begin="13" end="13" resetval="0x1" description="ADC12 REF OV VMON Error Mask to ESM Interrupt" range="13" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_L_ADC34_REF_UV_MASK" width="1" begin="12" end="12" resetval="0x1" description="ADC0 REF UV VMON Error Mask to ESM Interrupt" range="12" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_L_ADC34_REF_OV_MASK" width="1" begin="11" end="11" resetval="0x1" description="ADC0 REF OV VMON Error Mask to ESM Interrupt" range="11" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_L_CMP8_UV_ERR_MASK" width="1" begin="10" end="10" resetval="0x1" description="CMP8 UV VMON Error Mask to ESM Interrupt" range="10" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_L_CMP7_UV_ERR_MASK" width="1" begin="9" end="9" resetval="0x1" description="CMP7 UV VMON Error Mask to ESM Interrupt" range="9" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_L_CMP5_UV_ERR_MASK" width="1" begin="8" end="8" resetval="0x1" description="CMP5 UV VMON Error Mask to ESM Interrupt" range="8" rwaccess="R/W"/>
