ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/TOP_CTRL_TOP_CTRL_50D80000h.xml
	<bitfield id="MASK_VMON_ERROR_ESM_L_CMP5_OV_ERR_MASK" width="1" begin="7" end="7" resetval="0x1" description="CMP5 OV VMON Error Mask to ESM Interrupt" range="7" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_L_CMP3_UV_ERR_MASK" width="1" begin="6" end="6" resetval="0x1" description="CMP3 UV VMON Error Mask to ESM Interrupt" range="6" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_L_CMP3_OV_ERR_MASK" width="1" begin="5" end="5" resetval="0x1" description="CMP3 OV VMON Error Mask to ESM Interrupt" range="5" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_L_CMP2_UV_ERR_MASK" width="1" begin="4" end="4" resetval="0x1" description="CMP2 UV VMON Error Mask to ESM Interrupt" range="4" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_L_CMP2_OV_ERR_MASK" width="1" begin="3" end="3" resetval="0x1" description="CMP2 OV VMON Error Mask to ESM Interrupt" range="3" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_L_CMP1_UV_ERR_NASK" width="1" begin="2" end="2" resetval="0x1" description="CMP1 UV VMON Error Mask to ESM Interrupt" range="2" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_L_CMP1_OV_ERR_MASK" width="1" begin="1" end="1" resetval="0x1" description="CMP1 OV VMON Error Mask to ESM Interrupt" range="1" rwaccess="R/W"/>
	<bitfield id="MASK_VMON_ERROR_ESM_L_CMP0_UV_ERR_MASK" width="1" begin="0" end="0" resetval="0x1" description="CMP0 UV VMON Error Mask to ESM Interrupt" range="0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_MASK_ANA_ISO" acronym="TOP_CTRL_MASK_ANA_ISO" offset="3120" width="32" description="This register is used to prevent  the Coarse voltage monitor from triggering a faulty SOC reset  due to a momentary supply glitch caused when enabling ADC reference buffers.">
		<bitfield id="MASK_ANA_ISO_MASK" width="3" begin="2" end="0" resetval="0x0" description="Mask the Ana ISO generating SOC reset due to a glitch on VDD OK.Used during Trim updates to the analog or during ADC Refbuf enable" range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_VMON_FILTER_CTRL" acronym="TOP_CTRL_VMON_FILTER_CTRL" offset="3124" width="32" description="This register is used to configure the filter present on the Voltage monitor  outputs.">
		<bitfield id="VMON_FILTER_CTRL_SELECT_VALUE" width="2" begin="1" end="0" resetval="0x0" description="VMON FILTER control select2'b00 : no filtering [default]2'b01 : filtering for 4.8us2'b10 : filtering for 9.6us2'b11 : filtering for 14.4us**Note: This bit will only be reset by PORz." range="1:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_ADC_RNG_CTRL" acronym="TOP_CTRL_ADC_RNG_CTRL" offset="3136" width="32" description="ADC range control in single ended mode.">
		<bitfield id="ADC_RNG_CTRL_SCALED_MODE" width="2" begin="9" end="8" resetval="0x0" description="This bit controls scaled mode for resolver adc's2'b0 --> Normal output2'b1 --> scale 04223in 04095[efectively supporting 0-3.3V in 12 bit space] [in 12bit mode only]bit8 corresponds to adc_r0bit9 corresponds to adc_r1" range="9:8" rwaccess="R/W"/>
	<bitfield id="ADC_RNG_CTRL_MODE" width="7" begin="6" end="0" resetval="0x0" description="Single-Ended Mode, 0  ADC Input supports 0 to Vref*32/1. 0V corresponds to all zero code and 3.2V corresponds to all 1 or code40951  ADC Input supports Vref*1/18 to Vref*33/18. Vref*1/18 corresponds to all zero code and Vref*32/18 corresponds to all 1 or code4095  Differential Mode Don't take any effect on the system Default is 0Vcm=Vref*33/18/2 Vref = ADC reference voltage, typically 1.8V" range="6:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_ADC0_OSD_CHEN" acronym="TOP_CTRL_ADC0_OSD_CHEN" offset="3140" width="32" description="ADC Channel enable for Open Short detection.">
		<bitfield id="ADC0_OSD_CHEN_CH_OSD_EN" width="6" begin="5" end="0" resetval="0x0" description="Controls enabling the channel for ADC when set to 1'b1. Each bit corresponds to the respective ADC channel  -Bit 0  - ch0_osd_enBit 1   - ch1_osd_enBit 2   - ch2_osd_enBit 3   - ch3_osd_enBit 4   - ch4_osd_enBit 5   - ch5_osd_en" range="5:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_ADC1_OSD_CHEN" acronym="TOP_CTRL_ADC1_OSD_CHEN" offset="3144" width="32" description="ADC Channel enable for Open Short detection.">
		<bitfield id="ADC1_OSD_CHEN_CH_OSD_EN" width="6" begin="5" end="0" resetval="0x0" description="Controls enabling the channel for ADC when set to 1'b1. Each bit corresponds to the respective ADC channel  -Bit 0  - ch0_osd_enBit 1   - ch1_osd_enBit 2   - ch2_osd_enBit 3   - ch3_osd_enBit 4   - ch4_osd_enBit 5   - ch5_osd_en" range="5:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_ADC2_OSD_CHEN" acronym="TOP_CTRL_ADC2_OSD_CHEN" offset="3148" width="32" description="ADC Channel enable for Open Short detection.">
		<bitfield id="ADC2_OSD_CHEN_CH_OSD_EN" width="6" begin="5" end="0" resetval="0x0" description="Controls enabling the channel for ADC when set to 1'b1. Each bit corresponds to the respective ADC channel  -Bit 0  - ch0_osd_enBit 1   - ch1_osd_enBit 2   - ch2_osd_enBit 3   - ch3_osd_enBit 4   - ch4_osd_enBit 5   - ch5_osd_en" range="5:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_ADC3_OSD_CHEN" acronym="TOP_CTRL_ADC3_OSD_CHEN" offset="3152" width="32" description="ADC Channel enable for Open Short detection.">
		<bitfield id="ADC3_OSD_CHEN_CH_OSD_EN" width="6" begin="5" end="0" resetval="0x0" description="Controls enabling the channel for ADC when set to 1'b1. Each bit corresponds to the respective ADC channel  -Bit 0  - ch0_osd_enBit 1   - ch1_osd_enBit 2   - ch2_osd_enBit 3   - ch3_osd_enBit 4   - ch4_osd_enBit 5   - ch5_osd_en" range="5:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_ADC4_OSD_CHEN" acronym="TOP_CTRL_ADC4_OSD_CHEN" offset="3156" width="32" description="ADC Channel enable for Open Short detection.">
		<bitfield id="ADC4_OSD_CHEN_CH_OSD_EN" width="6" begin="5" end="0" resetval="0x0" description="Controls enabling the channel for ADC when set to 1'b1. Each bit corresponds to the respective ADC channel  -Bit 0  - ch0_osd_enBit 1   - ch1_osd_enBit 2   - ch2_osd_enBit 3   - ch3_osd_enBit 4   - ch4_osd_enBit 5   - ch5_osd_en" range="5:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_ADC0_OSD_CTRL" acronym="TOP_CTRL_ADC0_OSD_CTRL" offset="3160" width="32" description="ADC open short function controls.">
		<bitfield id="ADC0_OSD_CTRL_FUNCTION" width="3" begin="2" end="0" resetval="0x0" description="Controls the shorting of internal 5K, 11K resistor to the ADC channel for open short detection [Default 0] value    function         Impedance  5K voltage  7K voltage3'b000    Zero Scale     5K || 7K        vssa                vssa3'b001    Zero Scale     5K                    vssa               open3'b010    Zero Scale    7K                     open             vssa3'b011    Full Scale      5K || 7K         vdd_3p3v    vdd_3p3v3'b100    Full Scale      5K                    vdd_3p3v     open3'b101    Full Scale      7K                    open              vdd_3p3v3'b110    5/12 Scale     5K || 7K        vssa                vdd_3p3v3'b111    7/12 Scale     K || 7K           vdd_3p3v     vssa*all resistor values can vary by +  30%**Function is only correct if the external circuits driving the analog port are high impedance. If the port is connected to external circuits the customer will have to calculate the expected output." range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_ADC1_OSD_CTRL" acronym="TOP_CTRL_ADC1_OSD_CTRL" offset="3164" width="32" description="ADC open short function controls.">
		<bitfield id="ADC1_OSD_CTRL_FUNCTION" width="3" begin="2" end="0" resetval="0x0" description="Controls the shorting of internal 5K, 11K resistor to the ADC channel for open short detection [Default 0] value    function         Impedance  5K voltage  7K voltage3'b000    Zero Scale     5K || 7K        vssa                vssa3'b001    Zero Scale     5K                    vssa               open3'b010    Zero Scale    7K                     open             vssa3'b011    Full Scale      5K || 7K         vdd_3p3v    vdd_3p3v3'b100    Full Scale      5K                    vdd_3p3v     open3'b101    Full Scale      7K                    open              vdd_3p3v3'b110    5/12 Scale     5K || 7K        vssa                vdd_3p3v3'b111    7/12 Scale     K || 7K           vdd_3p3v     vssa*all resistor values can vary by +  30%**Function is only correct if the external circuits driving the analog port are high impedance. If the port is connected to external circuits the customer will have to calculate the expected output." range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_ADC2_OSD_CTRL" acronym="TOP_CTRL_ADC2_OSD_CTRL" offset="3168" width="32" description="ADC open short function controls.">
		<bitfield id="ADC2_OSD_CTRL_FUNCTION" width="3" begin="2" end="0" resetval="0x0" description="Controls the shorting of internal 5K, 11K resistor to the ADC channel for open short detection [Default 0] value    function         Impedance  5K voltage  7K voltage3'b000    Zero Scale     5K || 7K        vssa                vssa3'b001    Zero Scale     5K                    vssa               open3'b010    Zero Scale    7K                     open             vssa3'b011    Full Scale      5K || 7K         vdd_3p3v    vdd_3p3v3'b100    Full Scale      5K                    vdd_3p3v     open3'b101    Full Scale      7K                    open              vdd_3p3v3'b110    5/12 Scale     5K || 7K        vssa                vdd_3p3v3'b111    7/12 Scale     K || 7K           vdd_3p3v     vssa*all resistor values can vary by +  30%**Function is only correct if the external circuits driving the analog port are high impedance. If the port is connected to external circuits the customer will have to calculate the expected output." range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_ADC3_OSD_CTRL" acronym="TOP_CTRL_ADC3_OSD_CTRL" offset="3172" width="32" description="ADC open short function controls.">
		<bitfield id="ADC3_OSD_CTRL_FUNCTION" width="3" begin="2" end="0" resetval="0x0" description="Controls the shorting of internal 5K, 11K resistor to the ADC channel for open short detection [Default 0] value    function         Impedance  5K voltage  7K voltage3'b000    Zero Scale     5K || 7K        vssa                vssa3'b001    Zero Scale     5K                    vssa               open3'b010    Zero Scale    7K                     open             vssa3'b011    Full Scale      5K || 7K         vdd_3p3v    vdd_3p3v3'b100    Full Scale      5K                    vdd_3p3v     open3'b101    Full Scale      7K                    open              vdd_3p3v3'b110    5/12 Scale     5K || 7K        vssa                vdd_3p3v3'b111    7/12 Scale     K || 7K           vdd_3p3v     vssa*all resistor values can vary by +  30%**Function is only correct if the external circuits driving the analog port are high impedance. If the port is connected to external circuits the customer will have to calculate the expected output." range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_ADC4_OSD_CTRL" acronym="TOP_CTRL_ADC4_OSD_CTRL" offset="3176" width="32" description="ADC open short function controls.">
		<bitfield id="ADC4_OSD_CTRL_FUNCTION" width="3" begin="2" end="0" resetval="0x0" description="Controls the shorting of internal 5K, 11K resistor to the ADC channel for open short detection [Default 0] value    function         Impedance  5K voltage  7K voltage3'b000    Zero Scale     5K || 7K        vssa                vssa3'b001    Zero Scale     5K                    vssa               open3'b010    Zero Scale    7K                     open             vssa3'b011    Full Scale      5K || 7K         vdd_3p3v    vdd_3p3v3'b100    Full Scale      5K                    vdd_3p3v     open3'b101    Full Scale      7K                    open              vdd_3p3v3'b110    5/12 Scale     5K || 7K        vssa                vdd_3p3v3'b111    7/12 Scale     K || 7K           vdd_3p3v     vssa*all resistor values can vary by +  30%**Function is only correct if the external circuits driving the analog port are high impedance. If the port is connected to external circuits the customer will have to calculate the expected output." range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_ADC_LOOPBACK_CTRL" acronym="TOP_CTRL_ADC_LOOPBACK_CTRL" offset="3200" width="32" description="Controls loopback safety functionality from DAC output to ADC inputs.">
		<bitfield id="ADC_LOOPBACK_CTRL_ADC_LOOPBACK_EN" width="1" begin="0" end="0" resetval="0x0" description="Controls ADC loopback 1'b1: loopback enabled,1'b0: loopback disabled[default]" range="0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_CMPSSA_LOOPBACK_CTRL" acronym="TOP_CTRL_CMPSSA_LOOPBACK_CTRL" offset="3204" width="32" description="Controls loopback safety functionality from DAC output to ADC inputs.">
		<bitfield id="CMPSSA_LOOPBACK_CTRL_CMPSSH9_LOOPBACK_EN" width="1" begin="25" end="25" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="25" rwaccess="R/W"/>
	<bitfield id="CMPSSA_LOOPBACK_CTRL_CMPSSH8_LOOPBACK_EN" width="1" begin="24" end="24" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="24" rwaccess="R/W"/>
	<bitfield id="CMPSSA_LOOPBACK_CTRL_CMPSSH7_LOOPBACK_EN" width="1" begin="23" end="23" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="23" rwaccess="R/W"/>
	<bitfield id="CMPSSA_LOOPBACK_CTRL_CMPSSH6_LOOPBACK_EN" width="1" begin="22" end="22" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="22" rwaccess="R/W"/>
	<bitfield id="CMPSSA_LOOPBACK_CTRL_CMPSSH5_LOOPBACK_EN" width="1" begin="21" end="21" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="21" rwaccess="R/W"/>
	<bitfield id="CMPSSA_LOOPBACK_CTRL_CMPSSH4_LOOPBACK_EN" width="1" begin="20" end="20" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="20" rwaccess="R/W"/>
	<bitfield id="CMPSSA_LOOPBACK_CTRL_CMPSSH3_LOOPBACK_EN" width="1" begin="19" end="19" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="19" rwaccess="R/W"/>
	<bitfield id="CMPSSA_LOOPBACK_CTRL_CMPSSH2_LOOPBACK_EN" width="1" begin="18" end="18" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="18" rwaccess="R/W"/>
	<bitfield id="CMPSSA_LOOPBACK_CTRL_CMPSSH1_LOOPBACK_EN" width="1" begin="17" end="17" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="17" rwaccess="R/W"/>
	<bitfield id="CMPSSA_LOOPBACK_CTRL_CMPSSH0_LOOPBACK_EN" width="1" begin="16" end="16" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="16" rwaccess="R/W"/>
	<bitfield id="CMPSSA_LOOPBACK_CTRL_CMPSSL9_LOOPBACK_EN" width="1" begin="9" end="9" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="9" rwaccess="R/W"/>
	<bitfield id="CMPSSA_LOOPBACK_CTRL_CMPSSL8_LOOPBACK_EN" width="1" begin="8" end="8" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="8" rwaccess="R/W"/>
	<bitfield id="CMPSSA_LOOPBACK_CTRL_CMPSSL7_LOOPBACK_EN" width="1" begin="7" end="7" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="7" rwaccess="R/W"/>
	<bitfield id="CMPSSA_LOOPBACK_CTRL_CMPSSL6_LOOPBACK_EN" width="1" begin="6" end="6" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="6" rwaccess="R/W"/>
	<bitfield id="CMPSSA_LOOPBACK_CTRL_CMPSSL5_LOOPBACK_EN" width="1" begin="5" end="5" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="5" rwaccess="R/W"/>
	<bitfield id="CMPSSA_LOOPBACK_CTRL_CMPSSL4_LOOPBACK_EN" width="1" begin="4" end="4" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="4" rwaccess="R/W"/>
	<bitfield id="CMPSSA_LOOPBACK_CTRL_CMPSSL3_LOOPBACK_EN" width="1" begin="3" end="3" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSA_LOOPBACK_CTRL_CMPSSL2_LOOPBACK_EN" width="1" begin="2" end="2" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSA_LOOPBACK_CTRL_CMPSSL1_LOOPBACK_EN" width="1" begin="1" end="1" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSA_LOOPBACK_CTRL_CMPSSL0_LOOPBACK_EN" width="1" begin="0" end="0" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_CMPSSB_LOOPBACK_CTRL" acronym="TOP_CTRL_CMPSSB_LOOPBACK_CTRL" offset="3208" width="32" description="Controls loopback safety functionality from DAC output to ADC inputs.">
		<bitfield id="CMPSSB_LOOPBACK_CTRL_CMPSSH9_LOOPBACK_EN" width="1" begin="25" end="25" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="25" rwaccess="R/W"/>
	<bitfield id="CMPSSB_LOOPBACK_CTRL_CMPSSH8_LOOPBACK_EN" width="1" begin="24" end="24" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="24" rwaccess="R/W"/>
	<bitfield id="CMPSSB_LOOPBACK_CTRL_CMPSSH7_LOOPBACK_EN" width="1" begin="23" end="23" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="23" rwaccess="R/W"/>
	<bitfield id="CMPSSB_LOOPBACK_CTRL_CMPSSH6_LOOPBACK_EN" width="1" begin="22" end="22" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="22" rwaccess="R/W"/>
	<bitfield id="CMPSSB_LOOPBACK_CTRL_CMPSSH5_LOOPBACK_EN" width="1" begin="21" end="21" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="21" rwaccess="R/W"/>
	<bitfield id="CMPSSB_LOOPBACK_CTRL_CMPSSH4_LOOPBACK_EN" width="1" begin="20" end="20" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="20" rwaccess="R/W"/>
	<bitfield id="CMPSSB_LOOPBACK_CTRL_CMPSSH3_LOOPBACK_EN" width="1" begin="19" end="19" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="19" rwaccess="R/W"/>
	<bitfield id="CMPSSB_LOOPBACK_CTRL_CMPSSH2_LOOPBACK_EN" width="1" begin="18" end="18" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="18" rwaccess="R/W"/>
	<bitfield id="CMPSSB_LOOPBACK_CTRL_CMPSSH1_LOOPBACK_EN" width="1" begin="17" end="17" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="17" rwaccess="R/W"/>
	<bitfield id="CMPSSB_LOOPBACK_CTRL_CMPSSH0_LOOPBACK_EN" width="1" begin="16" end="16" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="16" rwaccess="R/W"/>
	<bitfield id="CMPSSB_LOOPBACK_CTRL_CMPSSL9_LOOPBACK_EN" width="1" begin="9" end="9" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="9" rwaccess="R/W"/>
	<bitfield id="CMPSSB_LOOPBACK_CTRL_CMPSSL8_LOOPBACK_EN" width="1" begin="8" end="8" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="8" rwaccess="R/W"/>
	<bitfield id="CMPSSB_LOOPBACK_CTRL_CMPSSL7_LOOPBACK_EN" width="1" begin="7" end="7" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="7" rwaccess="R/W"/>
	<bitfield id="CMPSSB_LOOPBACK_CTRL_CMPSSL6_LOOPBACK_EN" width="1" begin="6" end="6" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="6" rwaccess="R/W"/>
	<bitfield id="CMPSSB_LOOPBACK_CTRL_CMPSSL5_LOOPBACK_EN" width="1" begin="5" end="5" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="5" rwaccess="R/W"/>
	<bitfield id="CMPSSB_LOOPBACK_CTRL_CMPSSL4_LOOPBACK_EN" width="1" begin="4" end="4" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="4" rwaccess="R/W"/>
	<bitfield id="CMPSSB_LOOPBACK_CTRL_CMPSSL3_LOOPBACK_EN" width="1" begin="3" end="3" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSB_LOOPBACK_CTRL_CMPSSL2_LOOPBACK_EN" width="1" begin="2" end="2" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSB_LOOPBACK_CTRL_CMPSSL1_LOOPBACK_EN" width="1" begin="1" end="1" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSB_LOOPBACK_CTRL_CMPSSL0_LOOPBACK_EN" width="1" begin="0" end="0" resetval="0x0" description="Controls CMPSS loopback enable1'b1 : loopback enabled, 1'b0 : loopback disabled[default]" range="0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_ADCR01_OSD_CHEN" acronym="TOP_CTRL_ADCR01_OSD_CHEN" offset="3212" width="32" description="ADCR Channel enable for Open Short detection.">
		<bitfield id="ADCR01_OSD_CHEN_CH_OSD_EN" width="8" begin="7" end="0" resetval="0x0" description="Controls enabling the channel for ADC when set to 1'b1. Each bit corresponds to the respective ADC channel  -Bit 0  - ch0_osd_enBit 1   - ch1_osd_enBit 2   - ch2_osd_enBit 3   - ch3_osd_enBit 4   - ch4_osd_enBit 5   - ch5_osd_en" range="7:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_ADCR01_OSD_CTRL" acronym="TOP_CTRL_ADCR01_OSD_CTRL" offset="3216" width="32" description="ADCR open short function controls.">
