ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/TOP_CTRL_TOP_CTRL_50D80000h.xml
		<bitfield id="ADCR01_OSD_CTRL_FUNCTION" width="3" begin="2" end="0" resetval="0x0" description="Controls the shorting of internal 5K, 11K resistor to the ADC channel for open short detection [Default 0] value    function         Impedance  5K voltage  7K voltage3'b000    Zero Scale     5K || 7K        vssa                vssa3'b001    Zero Scale     5K                    vssa               open3'b010    Zero Scale    7K                     open             vssa3'b011    Full Scale      5K || 7K         vdd_3p3v    vdd_3p3v3'b100    Full Scale      5K                    vdd_3p3v     open3'b101    Full Scale      7K                    open              vdd_3p3v3'b110    5/12 Scale     5K || 7K        vssa                vdd_3p3v3'b111    7/12 Scale     K || 7K           vdd_3p3v     vssa*all resistor values can vary by +  30%**Function is only correct if the external circuits driving the analog port are high impedance. If the port is connected to external circuits the customer will have to calculate the expected output." range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_ADC_REFBUF2_CTRL" acronym="TOP_CTRL_ADC_REFBUF2_CTRL" offset="3220" width="32" description="This register is used to enable or disable ADC Reference buffer 2">
		<bitfield id="ADC_REFBUF2_CTRL_ENABLE" width="3" begin="2" end="0" resetval="0x0" description="Enables adc reference 0, mask hhv before enable000:Disable111 : Enable" range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_TSENSE_CFG" acronym="TOP_CTRL_TSENSE_CFG" offset="3328" width="32" description="This register is used to enableand configure  the Teperature sensors present in the device .">
		<bitfield id="TSENSE_CFG_TMPSOFF" width="1" begin="28" end="28" resetval="0x1" description="BandGap on/off control 1'b1 : off 1'b0 : on**Note: This bit will only be reset by PORz." range="28" rwaccess="R/W"/>
	<bitfield id="TSENSE_CFG_BGROFF" width="1" begin="24" end="24" resetval="0x1" description="BandGap on/off control 1'b1 : off 1'b0 : on**Note: This bit will only be reset by PORz." range="24" rwaccess="R/W"/>
	<bitfield id="TSENSE_CFG_AIPOFF" width="1" begin="20" end="20" resetval="0x1" description="1'b1 : iddq mode select 1'b0 : normal mode**Note: This bit will only be reset by PORz." range="20" rwaccess="R/W"/>
	<bitfield id="TSENSE_CFG_SNSR_MX_HIZ" width="1" begin="16" end="16" resetval="0x1" description="Sensor mux hiz control1'b0 : normal operation. Mux will select either one of the anlaog sensor  1'b1 : mux  will be high impedence**Note: This bit will only be reset by PORz." range="16" rwaccess="R/W"/>
	<bitfield id="TSENSE_CFG_DELAY" width="6" begin="13" end="8" resetval="0x0" description="Number of wait clock cycles between each TMPS Readout. Configure a Non zero value as delay value since configuring 0 is not allowed**Note: This bit will only be reset by PORz." range="13:8" rwaccess="R/W"/>
	<bitfield id="TSENSE_CFG_SENSOR_SEL" width="4" begin="7" end="4" resetval="0x0" description="Sensor Selection sensor enable bits for each sensor 1'b0 : sensor disable 1'b1 : sensor enablebit3: temp_sensor3bit2: temp_sensor2bit1: temp_sensor1bit0: temp_sensor0**Note: This bit will only be reset by PORz." range="7:4" rwaccess="R/W"/>
	<bitfield id="TSENSE_CFG_ENABLE" width="1" begin="0" end="0" resetval="0x0" description="Temperature controller enable**Note: This bit will only be reset by PORz." range="0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_TSENSE_STATUS" acronym="TOP_CTRL_TSENSE_STATUS" offset="3332" width="32" description="This register shows the status of Temperature comparator events which are unmasked.">
		<bitfield id="TSENSE_STATUS_S1_HOT" width="1" begin="6" end="6" resetval="0x0" description="temperature Sensor 1 hot event detect0 : event not occured1 : event occurred**Note: This bit will only be reset by PORz." range="6" rwaccess="R"/>
	<bitfield id="TSENSE_STATUS_S1_COLD" width="1" begin="5" end="5" resetval="0x0" description="temperature Sensor 1 cold event detect1'b0 : event not occured1'b1 : event occurred**Note: This bit will only be reset by PORz." range="5" rwaccess="R"/>
	<bitfield id="TSENSE_STATUS_S1_LOW_THRHLD" width="1" begin="4" end="4" resetval="0x0" description="temperature Sensor 1 low threshold event detect1'b0 : event not occured1'b1 : event occurred**Note: This bit will only be reset by PORz." range="4" rwaccess="R"/>
	<bitfield id="TSENSE_STATUS_S0_HOT" width="1" begin="2" end="2" resetval="0x0" description="temperature Sensor 0 hot event detect1'b0 : event not occured1'b1 : event occurred**Note: This bit will only be reset by PORz." range="2" rwaccess="R"/>
	<bitfield id="TSENSE_STATUS_S0_COLD" width="1" begin="1" end="1" resetval="0x0" description="temperature Sensor 0 cold event detect0 : event not occured1 : event occurred**Note: This bit will only be reset by PORz." range="1" rwaccess="R"/>
	<bitfield id="TSENSE_STATUS_S0_LOW_THRHLD" width="1" begin="0" end="0" resetval="0x0" description="temperature Sensor 0 low threshold event detect0 : event not occured1 : event occurred**Note: This bit will only be reset by PORz." range="0" rwaccess="R"/>
	</register><register id="TOP_CTRL_TSENSE_STATUS_RAW" acronym="TOP_CTRL_TSENSE_STATUS_RAW" offset="3336" width="32" description="This register shows the status of all Temperature comparators events including masked events.">
		<bitfield id="TSENSE_STATUS_RAW_S1_HOT" width="1" begin="6" end="6" resetval="0x0" description="temperature Sensor 1 hot event detect0 : event not occured1 : event occurred**Note: This bit will only be reset by PORz." range="6" rwaccess="R"/>
	<bitfield id="TSENSE_STATUS_RAW_S1_COLD" width="1" begin="5" end="5" resetval="0x0" description="temperature Sensor 1 cold event detect0 : event not occured1 : event occurred**Note: This bit will only be reset by PORz." range="5" rwaccess="R"/>
	<bitfield id="TSENSE_STATUS_RAW_S1_LOW_THRHLD" width="1" begin="4" end="4" resetval="0x0" description="temperature Sensor 1 low threshold event detect0 : event not occured1 : event occurred**Note: This bit will only be reset by PORz." range="4" rwaccess="R"/>
	<bitfield id="TSENSE_STATUS_RAW_S0_HOT" width="1" begin="2" end="2" resetval="0x0" description="temperature Sensor 0 hot event detect0 : event not occured1 : event occurred**Note: This bit will only be reset by PORz." range="2" rwaccess="R"/>
	<bitfield id="TSENSE_STATUS_RAW_S0_COLD" width="1" begin="1" end="1" resetval="0x0" description="temperature Sensor 0 cold event detect0 : event not occured1 : event occurred**Note: This bit will only be reset by PORz." range="1" rwaccess="R"/>
	<bitfield id="TSENSE_STATUS_RAW_S0_LOW_THRHLD" width="1" begin="0" end="0" resetval="0x0" description="temperature Sensor 0 low threshold event detect0 : event not occured1 : event occurred**Note: This bit will only be reset by PORz." range="0" rwaccess="R"/>
	</register><register id="TOP_CTRL_TSENSE0_ALERT" acronym="TOP_CTRL_TSENSE0_ALERT" offset="3348" width="32" description="This register is used to configure the temperature thresholds for Temp Sensor 0 for generating Alert Interrupts.">
		<bitfield id="TSENSE0_ALERT_ALERT_THRHLD_COLD" width="8" begin="23" end="16" resetval="0x0" description="cold threshold/low temp threshold**Note: This bit will only be reset by PORz." range="23:16" rwaccess="R/W"/>
	<bitfield id="TSENSE0_ALERT_ALERT_THRHLD_HOT" width="8" begin="7" end="0" resetval="0x0" description="Hot threshold/high temp threshold**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_TSENSE0_CNTL" acronym="TOP_CTRL_TSENSE0_CNTL" offset="3352" width="32" description="This register is used to control and configure Temperature sensor 0">
		<bitfield id="TSENSE0_CNTL_MASK_LOW_THRHLD" width="1" begin="24" end="24" resetval="0x0" description="mask low threshold comparator output**Note: This bit will only be reset by PORz." range="24" rwaccess="R/W"/>
	<bitfield id="TSENSE0_CNTL_MASK_HOT" width="1" begin="20" end="20" resetval="0x1" description="Mask hot comparator output**Note: This bit will only be reset by PORz." range="20" rwaccess="R/W"/>
	<bitfield id="TSENSE0_CNTL_MASK_COLD" width="1" begin="16" end="16" resetval="0x0" description="mask cold comparator output**Note: This bit will only be reset by PORz." range="16" rwaccess="R/W"/>
	<bitfield id="TSENSE0_CNTL_ACCU_CLEAR" width="1" begin="8" end="8" resetval="0x0" description="Accumulator clear**Note: This bit will only be reset by PORz." range="8" rwaccess="R/W"/>
	<bitfield id="TSENSE0_CNTL_FIFO_FREEZE" width="1" begin="4" end="4" resetval="0x0" description="fifo freeze**Note: This bit will only be reset by PORz." range="4" rwaccess="R/W"/>
	<bitfield id="TSENSE0_CNTL_FIFO_CLEAR" width="1" begin="0" end="0" resetval="0x0" description="fifo clear**Note: This bit will only be reset by PORz." range="0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_TSENSE0_RESULT" acronym="TOP_CTRL_TSENSE0_RESULT" offset="3356" width="32" description="This register shows the most recent temperature readout and  status of any ongoing Temperature measurement from Temperature Sensor 0  ">
		<bitfield id="TSENSE0_RESULT_ECOZ" width="1" begin="16" end="16" resetval="0x0" description="Conversion in Progress.1'b1 : Conversion on going1'b0 : conversion completed**Note: This bit will only be reset by PORz." range="16" rwaccess="R"/>
	<bitfield id="TSENSE0_RESULT_DTEMP" width="8" begin="7" end="0" resetval="0x255" description="Temp Code readout**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_TSENSE0_DATA0" acronym="TOP_CTRL_TSENSE0_DATA0" offset="3360" width="32" description="Temp Sensor 0 Result FIFO Register 0">
		<bitfield id="TSENSE0_DATA0_TAG" width="24" begin="31" end="8" resetval="0x0" description="Tag for temperature sesnor 0 Data 0 measured**Note: This bit will only be reset by PORz." range="31:8" rwaccess="R"/>
	<bitfield id="TSENSE0_DATA0_DATA" width="8" begin="7" end="0" resetval="0x255" description="Temperature Sensor0 FIFO data 0**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_TSENSE0_DATA1" acronym="TOP_CTRL_TSENSE0_DATA1" offset="3364" width="32" description="Temp Sensor 0 Result FIFO Register 1">
		<bitfield id="TSENSE0_DATA1_TAG" width="24" begin="31" end="8" resetval="0x0" description="Tag for temperature sesnor 0 Data 1 measured**Note: This bit will only be reset by PORz." range="31:8" rwaccess="R"/>
	<bitfield id="TSENSE0_DATA1_DATA" width="8" begin="7" end="0" resetval="0x0" description="Temperature Sensor0 FIFO data 1**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_TSENSE0_DATA2" acronym="TOP_CTRL_TSENSE0_DATA2" offset="3368" width="32" description="Temp Sensor 0 Result FIFO Register 2">
		<bitfield id="TSENSE0_DATA2_TAG" width="24" begin="31" end="8" resetval="0x0" description="Tag for temperature sesnor 0 Data 2 measured**Note: This bit will only be reset by PORz." range="31:8" rwaccess="R"/>
	<bitfield id="TSENSE0_DATA2_DATA" width="8" begin="7" end="0" resetval="0x0" description="Temperature Sensor 0 FIFO data 2**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_TSENSE0_DATA3" acronym="TOP_CTRL_TSENSE0_DATA3" offset="3372" width="32" description="Temp Sensor 0 Result FIFO Register 3">
		<bitfield id="TSENSE0_DATA3_TAG" width="24" begin="31" end="8" resetval="0x0" description="Tag for temperature sesnor 0 Data 3 measured**Note: This bit will only be reset by PORz." range="31:8" rwaccess="R"/>
	<bitfield id="TSENSE0_DATA3_DATA" width="8" begin="7" end="0" resetval="0x0" description="Temperature Sensor 0 FIFO data 3**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_TSENSE0_ACCU" acronym="TOP_CTRL_TSENSE0_ACCU" offset="3376" width="32" description="Temp Sensor 0 Result Accumulator Register.">
		<bitfield id="TSENSE0_ACCU_CUMUL" width="32" begin="31" end="0" resetval="0x0" description="cumulative sum of past DTEMPs**Note: This bit will only be reset by PORz." range="31:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_TSENSE1_TSHUT" acronym="TOP_CTRL_TSENSE1_TSHUT" offset="3392" width="32" description="This register is used to override the factory specified Tshut temperature with an application specific Tshut temperature for Temperature sensor 1">
		<bitfield id="TSENSE1_TSHUT_EFUSE_OVERRIDE" width="3" begin="31" end="29" resetval="0x0" description="Efuse override3'b000 -- Value from EFUSE is used as tshut hot and tshut cold thresholds3'b111 - Overide value takes effect**Note: This bit will only be reset by PORz." range="31:29" rwaccess="R/W"/>
	<bitfield id="TSENSE1_TSHUT_TSHUT_THRHLD_HOT" width="8" begin="23" end="16" resetval="0x0" description="tshut hot threshold. Reads efuse value untill overwritten with override = 111**Note: This bit will only be reset by PORz." range="23:16" rwaccess="R/W"/>
	<bitfield id="TSENSE1_TSHUT_TSHUT_THRSHLD_COLD" width="8" begin="7" end="0" resetval="0x0" description="tshut cold threshold. Reads efuse value untill overwritten with override = 111**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_TSENSE1_ALERT" acronym="TOP_CTRL_TSENSE1_ALERT" offset="3396" width="32" description="This register is used to configure the temperature thresholds for Temp Sensor 1 for generating Alert Interrupts.">
		<bitfield id="TSENSE1_ALERT_ALERT_THRHLD_COLD" width="8" begin="23" end="16" resetval="0x0" description="cold threshold/low temp threshold**Note: This bit will only be reset by PORz." range="23:16" rwaccess="R/W"/>
	<bitfield id="TSENSE1_ALERT_ALERT_THRHLD_HOT" width="8" begin="7" end="0" resetval="0x0" description="Hot threshold/high temp threshold**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_TSENSE1_CNTL" acronym="TOP_CTRL_TSENSE1_CNTL" offset="3400" width="32" description="This register is used to control and configure Temperature sensor 1">
		<bitfield id="TSENSE1_CNTL_MASK_LOW_THRHLD" width="1" begin="24" end="24" resetval="0x0" description="mask low threshold comparator output**Note: This bit will only be reset by PORz." range="24" rwaccess="R/W"/>
	<bitfield id="TSENSE1_CNTL_MASK_HOT" width="1" begin="20" end="20" resetval="0x1" description="Mask hot comparator output**Note: This bit will only be reset by PORz." range="20" rwaccess="R/W"/>
	<bitfield id="TSENSE1_CNTL_MASK_COLD" width="1" begin="16" end="16" resetval="0x0" description="mask cold comparator output**Note: This bit will only be reset by PORz." range="16" rwaccess="R/W"/>
	<bitfield id="TSENSE1_CNTL_ACCU_CLEAR" width="1" begin="8" end="8" resetval="0x0" description="Accumulator clear**Note: This bit will only be reset by PORz." range="8" rwaccess="R/W"/>
	<bitfield id="TSENSE1_CNTL_FIFO_FREEZE" width="1" begin="4" end="4" resetval="0x0" description="fifo freeze**Note: This bit will only be reset by PORz." range="4" rwaccess="R/W"/>
	<bitfield id="TSENSE1_CNTL_FIFO_CLEAR" width="1" begin="0" end="0" resetval="0x0" description="fifo clear**Note: This bit will only be reset by PORz." range="0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_TSENSE1_RESULT" acronym="TOP_CTRL_TSENSE1_RESULT" offset="3404" width="32" description="This register shows the most recent temperature readout and  status of any ongoing Temperature measurement from Temperature Sensor 1">
		<bitfield id="TSENSE1_RESULT_ECOZ" width="1" begin="16" end="16" resetval="0x0" description="Conversion in Progress.1'b1 : Conversion on going1'b0 : conversion completed**Note: This bit will only be reset by PORz." range="16" rwaccess="R"/>
	<bitfield id="TSENSE1_RESULT_DTEMP" width="8" begin="7" end="0" resetval="0x255" description="Temp Code readout**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_TSENSE1_DATA0" acronym="TOP_CTRL_TSENSE1_DATA0" offset="3408" width="32" description="Temp Sensor 1 Result FIFO Register 0">
		<bitfield id="TSENSE1_DATA0_TAG" width="24" begin="31" end="8" resetval="0x0" description="Tag for temperature sesnor 1 Data 0 measured**Note: This bit will only be reset by PORz." range="31:8" rwaccess="R"/>
	<bitfield id="TSENSE1_DATA0_DATA" width="8" begin="7" end="0" resetval="0x255" description="Temperature sensor 1 FIFO Data 0**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_TSENSE1_DATA1" acronym="TOP_CTRL_TSENSE1_DATA1" offset="3412" width="32" description="Temp Sensor 1 Result FIFO Register 1">
		<bitfield id="TSENSE1_DATA1_TAG" width="24" begin="31" end="8" resetval="0x0" description="Temperature sensor 1 FIFO Data 1**Note: This bit will only be reset by PORz." range="31:8" rwaccess="R"/>
	<bitfield id="TSENSE1_DATA1_DATA" width="8" begin="7" end="0" resetval="0x0" description="Temperature sensor 1 FIFO Data 1**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_TSENSE1_DATA2" acronym="TOP_CTRL_TSENSE1_DATA2" offset="3416" width="32" description="Temp Sensor 1 Result FIFO Register 2">
		<bitfield id="TSENSE1_DATA2_TAG" width="24" begin="31" end="8" resetval="0x0" description="Temperature sensor 1 FIFO Data 2**Note: This bit will only be reset by PORz." range="31:8" rwaccess="R"/>
	<bitfield id="TSENSE1_DATA2_DATA" width="8" begin="7" end="0" resetval="0x0" description="Temperature sensor 1 FIFO Data 2**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_TSENSE1_DATA3" acronym="TOP_CTRL_TSENSE1_DATA3" offset="3420" width="32" description="Temp Sensor 1 Result FIFO Register 3">
		<bitfield id="TSENSE1_DATA3_TAG" width="24" begin="31" end="8" resetval="0x0" description="Temperature sensor 1 FIFO Data 3**Note: This bit will only be reset by PORz." range="31:8" rwaccess="R"/>
	<bitfield id="TSENSE1_DATA3_DATA" width="8" begin="7" end="0" resetval="0x0" description="Temperature sensor 1 FIFO Data 3**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_TSENSE1_ACCU" acronym="TOP_CTRL_TSENSE1_ACCU" offset="3424" width="32" description="Temp Sensor 1 Result Accumulator Register.">
		<bitfield id="TSENSE1_ACCU_CUMUL" width="32" begin="31" end="0" resetval="0x0" description="cumulative sum of past DTEMPs**Note: This bit will only be reset by PORz." range="31:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_TSENSE2_RESULT" acronym="TOP_CTRL_TSENSE2_RESULT" offset="3452" width="32" description="This register shows the most recent temperature readout and  status of any ongoing Temperature measurement from Temperature Sensor 2">
		<bitfield id="TSENSE2_RESULT_ECOZ" width="1" begin="16" end="16" resetval="0x0" description="Conversion in Progress.1'b1 : Conversion on going1'b0 : conversion completed**Note: This bit will only be reset by PORz." range="16" rwaccess="R"/>
	<bitfield id="TSENSE2_RESULT_DTEMP" width="8" begin="7" end="0" resetval="0x0" description="Temp Code readout**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_TSENSE3_RESULT" acronym="TOP_CTRL_TSENSE3_RESULT" offset="3500" width="32" description="This register shows the most recent temperature readout and  status of any ongoing Temperature measurement from Temperature Sensor 3">
		<bitfield id="TSENSE3_RESULT_ECOZ" width="1" begin="16" end="16" resetval="0x0" description="Conversion in Progress.1'b1 : Conversion on going1'b0 : conversion completed**Note: This bit will only be reset by PORz." range="16" rwaccess="R"/>
	<bitfield id="TSENSE3_RESULT_DTEMP" width="8" begin="7" end="0" resetval="0x0" description="Temp Code readout**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_HW_SPARE_RW0" acronym="TOP_CTRL_HW_SPARE_RW0" offset="4048" width="32" description="HW_SPARE_RW0.">
		<bitfield id="HW_SPARE_RW0_HW_SPARE_RW0" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_HW_SPARE_RW1" acronym="TOP_CTRL_HW_SPARE_RW1" offset="4052" width="32" description="HW_SPARE_RW1.">
		<bitfield id="HW_SPARE_RW1_HW_SPARE_RW1" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_HW_SPARE_RW2" acronym="TOP_CTRL_HW_SPARE_RW2" offset="4056" width="32" description="HW_SPARE_RW2.">
		<bitfield id="HW_SPARE_RW2_HW_SPARE_RW2" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_HW_SPARE_RW3" acronym="TOP_CTRL_HW_SPARE_RW3" offset="4060" width="32" description="HW_SPARE_RW3.">
		<bitfield id="HW_SPARE_RW3_HW_SPARE_RW3" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_HW_SPARE_RO0" acronym="TOP_CTRL_HW_SPARE_RO0" offset="4064" width="32" description="HW_SPARE_RO0.">
		<bitfield id="HW_SPARE_RO0_HW_SPARE_RO0" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_HW_SPARE_RO1" acronym="TOP_CTRL_HW_SPARE_RO1" offset="4068" width="32" description="HW_SPARE_RO1.">
		<bitfield id="HW_SPARE_RO1_HW_SPARE_RO1" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_HW_SPARE_RO2" acronym="TOP_CTRL_HW_SPARE_RO2" offset="4072" width="32" description="HW_SPARE_RO2.">
		<bitfield id="HW_SPARE_RO2_HW_SPARE_RO2" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_HW_SPARE_RO3" acronym="TOP_CTRL_HW_SPARE_RO3" offset="4076" width="32" description="HW_SPARE_RO3.">
		<bitfield id="HW_SPARE_RO3_HW_SPARE_RO3" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_HW_SPARE_WPH" acronym="TOP_CTRL_HW_SPARE_WPH" offset="4080" width="32" description="HW_SPARE_WPH.">
		<bitfield id="HW_SPARE_WPH_HW_SPARE_WPH" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_HW_SPARE_REC" acronym="TOP_CTRL_HW_SPARE_REC" offset="4084" width="32" description="HW_SPARE_REC.">
		<bitfield id="HW_SPARE_REC_HW_SPARE_REC31" width="1" begin="31" end="31" resetval="0x0" description="Reserved for HW R&#38;D" range="31" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC30" width="1" begin="30" end="30" resetval="0x0" description="Reserved for HW R&#38;D" range="30" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC29" width="1" begin="29" end="29" resetval="0x0" description="Reserved for HW R&#38;D" range="29" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC28" width="1" begin="28" end="28" resetval="0x0" description="Reserved for HW R&#38;D" range="28" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC27" width="1" begin="27" end="27" resetval="0x0" description="Reserved for HW R&#38;D" range="27" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC26" width="1" begin="26" end="26" resetval="0x0" description="Reserved for HW R&#38;D" range="26" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC25" width="1" begin="25" end="25" resetval="0x0" description="Reserved for HW R&#38;D" range="25" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC24" width="1" begin="24" end="24" resetval="0x0" description="Reserved for HW R&#38;D" range="24" rwaccess="R/W"/>
