ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/TOP_CTRL_TOP_CTRL_50D80000h.xml
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC23" width="1" begin="23" end="23" resetval="0x0" description="Reserved for HW R&#38;D" range="23" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC22" width="1" begin="22" end="22" resetval="0x0" description="Reserved for HW R&#38;D" range="22" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC21" width="1" begin="21" end="21" resetval="0x0" description="Reserved for HW R&#38;D" range="21" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC20" width="1" begin="20" end="20" resetval="0x0" description="Reserved for HW R&#38;D" range="20" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC19" width="1" begin="19" end="19" resetval="0x0" description="Reserved for HW R&#38;D" range="19" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC18" width="1" begin="18" end="18" resetval="0x0" description="Reserved for HW R&#38;D" range="18" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC17" width="1" begin="17" end="17" resetval="0x0" description="Reserved for HW R&#38;D" range="17" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC16" width="1" begin="16" end="16" resetval="0x0" description="Reserved for HW R&#38;D" range="16" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC15" width="1" begin="15" end="15" resetval="0x0" description="Reserved for HW R&#38;D" range="15" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC14" width="1" begin="14" end="14" resetval="0x0" description="Reserved for HW R&#38;D" range="14" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC13" width="1" begin="13" end="13" resetval="0x0" description="Reserved for HW R&#38;D" range="13" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC12" width="1" begin="12" end="12" resetval="0x0" description="Reserved for HW R&#38;D" range="12" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC11" width="1" begin="11" end="11" resetval="0x0" description="Reserved for HW R&#38;D" range="11" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC10" width="1" begin="10" end="10" resetval="0x0" description="Reserved for HW R&#38;D" range="10" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC9" width="1" begin="9" end="9" resetval="0x0" description="Reserved for HW R&#38;D" range="9" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC8" width="1" begin="8" end="8" resetval="0x0" description="Reserved for HW R&#38;D" range="8" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC7" width="1" begin="7" end="7" resetval="0x0" description="Reserved for HW R&#38;D" range="7" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC6" width="1" begin="6" end="6" resetval="0x0" description="Reserved for HW R&#38;D" range="6" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC5" width="1" begin="5" end="5" resetval="0x0" description="Reserved for HW R&#38;D" range="5" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC4" width="1" begin="4" end="4" resetval="0x0" description="Reserved for HW R&#38;D" range="4" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC3" width="1" begin="3" end="3" resetval="0x0" description="Reserved for HW R&#38;D" range="3" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC2" width="1" begin="2" end="2" resetval="0x0" description="Reserved for HW R&#38;D" range="2" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC1" width="1" begin="1" end="1" resetval="0x0" description="Reserved for HW R&#38;D" range="1" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC0" width="1" begin="0" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_LOCK0_KICK0" acronym="TOP_CTRL_LOCK0_KICK0" offset="4104" width="32" description=" - KICK0 component.">
		<bitfield id="LOCK0_KICK0" width="32" begin="31" end="0" resetval="0x0" description=" - KICK0 component" range="31:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_LOCK0_KICK1" acronym="TOP_CTRL_LOCK0_KICK1" offset="4108" width="32" description=" - KICK1 component.">
		<bitfield id="LOCK0_KICK1" width="32" begin="31" end="0" resetval="0x0" description=" - KICK1 component" range="31:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_INTR_RAW_STATUS" acronym="TOP_CTRL_INTR_RAW_STATUS" offset="4112" width="32" description="Interrupt Raw Status/Set Register.">
		<bitfield id="PROXY_ERR" width="1" begin="3" end="3" resetval="0x0" description="Proxy0 access violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="3" rwaccess="R/W1TS"/>
	<bitfield id="KICK_ERR" width="1" begin="2" end="2" resetval="0x0" description="Kick access violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="2" rwaccess="R/W1TS"/>
	<bitfield id="ADDR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="1" rwaccess="R/W1TS"/>
	<bitfield id="PROT_ERR" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="0" rwaccess="R/W1TS"/>
	</register><register id="TOP_CTRL_INTR_ENABLED_STATUS_CLEAR" acronym="TOP_CTRL_INTR_ENABLED_STATUS_CLEAR" offset="4116" width="32" description="Interrupt Enabled Status/Clear register.">
		<bitfield id="ENABLED_PROXY_ERR" width="1" begin="3" end="3" resetval="0x0" description="Proxy0 access violation error. Enabled status is read. Write a 1 to clear the status. Writing a 0 has no effect." range="3" rwaccess="R/W1TC"/>
	<bitfield id="ENABLED_KICK_ERR" width="1" begin="2" end="2" resetval="0x0" description="Kick access violation error. Enabled status is read. Write a 1 to clear the status. Writing a 0 has no effect." range="2" rwaccess="R/W1TC"/>
	<bitfield id="ENABLED_ADDR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error. Enabled status is read. Write a 1 to clear the status. Writing a 0 has no effect." range="1" rwaccess="R/W1TC"/>
	<bitfield id="ENABLED_PROT_ERR" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error. Enabled status is read. Write a 1 to clear the status. Writing a 0 has no effect." range="0" rwaccess="R/W1TC"/>
	</register><register id="TOP_CTRL_INTR_ENABLE" acronym="TOP_CTRL_INTR_ENABLE" offset="4120" width="32" description="Interrupt Enable register.">
		<bitfield id="PROXY_ERR_EN" width="1" begin="3" end="3" resetval="0x0" description="Proxy0 access violation error enable. Write a 1 to set the enable. Writing a 0 has no effect." range="3" rwaccess="R/W1TS"/>
	<bitfield id="KICK_ERR_EN" width="1" begin="2" end="2" resetval="0x0" description="Kick access violation error enable. Write a 1 to set the enable. Writing a 0 has no effect." range="2" rwaccess="R/W1TS"/>
	<bitfield id="ADDR_ERR_EN" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error enable. Write a 1 to set the enable. Writing a 0 has no effect." range="1" rwaccess="R/W1TS"/>
	<bitfield id="PROT_ERR_EN" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error enable. Write a 1 to set the enable. Writing a 0 has no effect." range="0" rwaccess="R/W1TS"/>
	</register><register id="TOP_CTRL_INTR_ENABLE_CLEAR" acronym="TOP_CTRL_INTR_ENABLE_CLEAR" offset="4124" width="32" description="Interrupt Enable Clear register.">
		<bitfield id="PROXY_ERR_EN_CLR" width="1" begin="3" end="3" resetval="0x0" description="Proxy0 access violation error enable clear. Write a 1 to clear the enable. Writing a 0 has no effect." range="3" rwaccess="R/W1TC"/>
	<bitfield id="KICK_ERR_EN_CLR" width="1" begin="2" end="2" resetval="0x0" description="Kick access violation error enable clear. Write a 1 to clear the enable. Writing a 0 has no effect." range="2" rwaccess="R/W1TC"/>
	<bitfield id="ADDR_ERR_EN_CLR" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error enable clear. Write a 1 to clear the enable. Writing a 0 has no effect." range="1" rwaccess="R/W1TC"/>
	<bitfield id="PROT_ERR_EN_CLR" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error enable clear. Write a 1 to clear the enable. Writing a 0 has no effect." range="0" rwaccess="R/W1TC"/>
	</register><register id="TOP_CTRL_EOI" acronym="TOP_CTRL_EOI" offset="4128" width="32" description="EOI register.">
		<bitfield id="EOI_VECTOR" width="8" begin="7" end="0" resetval="0x0" description="EOI vector value. Write this with interrupt distribution value in the chip." range="7:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_FAULT_ADDRESS" acronym="TOP_CTRL_FAULT_ADDRESS" offset="4132" width="32" description="Fault Address register.">
		<bitfield id="FAULT_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Fault Address." range="31:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_FAULT_TYPE_STATUS" acronym="TOP_CTRL_FAULT_TYPE_STATUS" offset="4136" width="32" description="Fault Type Status register.">
		<bitfield id="FAULT_NS" width="1" begin="6" end="6" resetval="0x0" description="Non-secure access." range="6" rwaccess="R"/>
	<bitfield id="FAULT_TYPE" width="6" begin="5" end="0" resetval="0x0" description="Fault Type  10_0000 = Supervisor read  fault  - priv = 1 dir = 1 dtype != 1   01_0000 = Supervisor write fault  - priv = 1 dir = 0  00_1000 = Supervisor execute fault - priv = 1 dir = 1 dtype = 1  00_0100 = User read  fault - priv = 0 dir = 1 dtype = 1  00_0010 = User write fault - priv = 0 dir = 0  00_0001 = User execute fault - priv = 0 dir = 1 dtype = 1  00_0000 = No fault" range="5:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_FAULT_ATTR_STATUS" acronym="TOP_CTRL_FAULT_ATTR_STATUS" offset="4140" width="32" description="Fault Attribute Status register.">
		<bitfield id="FAULT_XID" width="12" begin="31" end="20" resetval="0x0" description="XID." range="31:20" rwaccess="R"/>
	<bitfield id="FAULT_ROUTEID" width="12" begin="19" end="8" resetval="0x0" description="Route ID." range="19:8" rwaccess="R"/>
	<bitfield id="FAULT_PRIVID" width="8" begin="7" end="0" resetval="0x0" description="Privilege ID." range="7:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_FAULT_CLEAR" acronym="TOP_CTRL_FAULT_CLEAR" offset="4144" width="32" description="Fault Clear register.">
		<bitfield id="FAULT_CLR" width="1" begin="0" end="0" resetval="0x0" description="Fault clear. Writing a 1 clears the current fault. Writing a 0 has no effect." range="0" rwaccess="W"/>
	</register>
</module>